{
    "welcome_message": "कहानी कहने के लिए बस एक बूंद चाहिए",
    "short_description": "एक रचनात्मक डेवलपर",
    "customize": "अपने अनुभव को अनुकूलित करें",
    "choose_theme": "थीम चुनें",
    "choose_style": "स्टाइल चुनें",
    "discover_more": "और ढूंढें",
    "software_developer": "सॉफ्टवेयर डेवलपर",
    "bio": "मैं रोम, इटली में स्थित एक {years} वर्षीय सॉफ्टवेयर डेवलपर हूं। मैंने वेब पर बेहतरीन सॉफ़्टवेयर बनाने में मदद करने के लिए फ्रंट-एंड और बैक-एंड सिस्टम्स और टेक्नोलॉजीज के साथ काम किया है। अपने कार्य अनुभव के दौरान मैंने विभिन्न कंपनियों को उनके व्यवसाय को डिजिटल बनाने में सहायता की है। मेरे पास विकास, डिजाइन, परीक्षण, बग फिक्सिंग, रखरखाव और सबसे आधुनिक विकास ढांचे का उपयोग करके वेब या मोबाइल अनुप्रयोगों के अनुकूलन का अनुभव है।",
    "long_bio": "रोम, इटली में स्थित एक {years}-वर्षीय सॉफ़्टवेयर डेवलपर के रूप में, मुझे फ्रंट-एंड और बैक-एंड सिस्टम और तकनीकों दोनों के साथ काम करने का सौभाग्य मिला है, जिसने मुझे वेब पर शानदार सॉफ़्टवेयर बनाने की अनुमति दी है। अपने कार्य अनुभव के दौरान, मुझे विभिन्न कंपनियों को उनके व्यवसायों के डिजिटलीकरण और अनुकूलन में सहायता करने का अवसर मिला है। मैंने ग्राहकों को उनकी जरूरतों और लक्ष्यों को समझने में मदद की है और उनकी अपेक्षाओं से अधिक समाधान तैयार और कार्यान्वित किया है। मेरे विकास कार्य के अलावा, मेरे पास डिजाइन, परीक्षण, बग फिक्सिंग, रखरखाव और वेब या मोबाइल एप्लिकेशन के अनुकूलन का अनुभव है। इसमें कोड की समीक्षा करना, समस्याओं का निवारण करना और यह सुनिश्चित करने के लिए प्रदर्शन को अनुकूलित करना शामिल है कि एप्लिकेशन सुचारू रूप से और कुशलता से चल रहे हैं। <br><br>मैं जावास्क्रिप्ट, एचटीएमएल, सीएसएस, पायथन, पीएचपी और सी # जैसी प्रोग्रामिंग भाषाओं में भी कुशल हूं, साथ ही साथ रिएक्ट, एंगुलर, वीयू, लारवेल, एएसपी .NET, डीजेंगो और नोड जैसे फ्रेमवर्क और टूल भी। .जेएस। <br><br>मेरे अनुभव ने मुझे आधुनिक विकास ढांचे और उपकरणों की गहरी समझ दी है जो उच्च गुणवत्ता वाले सॉफ़्टवेयर के निर्माण के लिए आवश्यक हैं। मेरे पास डेटाबेस, क्लाउड प्लेटफॉर्म और अन्य टूल्स के साथ काम करने की एक मजबूत पृष्ठभूमि है जो आमतौर पर सॉफ्टवेयर डेवलपमेंट में उपयोग किए जाते हैं। <br><br>कुल मिलाकर, मैं एक कुशल सॉफ्टवेयर डेवलपर हूं, जो सभी आकार की कंपनियों को अनुकूलित सॉफ्टवेयर समाधानों के माध्यम से अपने लक्ष्यों को प्राप्त करने में मदद करने के लिए समर्पित है। चाहे वह स्क्रैच से एक नया एप्लिकेशन बना रहा हो या किसी मौजूदा को अनुकूलित कर रहा हो, मुझे उम्मीदों को पूरा करने और उससे अधिक परिणाम देने की अपनी क्षमता पर भरोसा है।",
    "menu":{
        "about": "विवरण",
        "skills": "कौशल",
        "experiences": "अनुभव",
        "contacts": "संपर्क"
    },
    "degg":{
        "short_description": "सॉफ्टवेयर और लीड डेवलपर",
        "roles":{
        "software_developer":{
                "name": "सॉफ्टवेयर डेवलपर",
                "description": "प्रोजेक्ट सेट अप, विकसित करें या पर्यवेक्षण करें। प्रोग्राम या एप्लिकेशन इंस्टॉल करें। कार्यात्मक डिजाइन और इंटरफेस विकास के लिए टूल और प्रक्रियाओं को अपनाएं। डेटाबेस के कार्यात्मक डिजाइन के लिए टूल और प्रक्रियाएँ अपनाएं। विकास उपकरणों की मदद से डेटाबेस का उत्पादन उत्पन्न करने के लिए प्रक्रियाओं को अपनाएं। वेबसाइट बनाना।"
            },
            "lead_software_developer":{
                "name": "लीड सॉफ्टवेयर डेवलपर",
                "description": "सॉफ्टवेयर और अन्य एप्लिकेशन बनाएं, संशोधित करें या सत्यापित करें। ग्राहकों के साथ संबंध बनाए रखें। ग्राहक समर्थन प्रदान करें। लक्ष्य और अंतिम तिथियों को हासिल करने के लिए टीम का प्रबंधन करें। फ्रंटएंड और बैकएंड तकनीकों पर संसाधनों को प्रशिक्षित करें। सॉफ्टवेयर या कंप्यूटर सिस्टमों पर ग्राहकों को सलाह दें।"
            },
            "cto":{
                "name": "सीटीओ",
                "description": "कंपनी के प्रौद्योगिकी योजनाओं का प्रबंधन। विभिन्न प्रकार की प्रौद्योगिकी कंपनी भर में कैसे उपयोग की जाएगी यह कल्पना करें। कंपनी की तकनीकी संपत्तियों को सुधारने के तरीके ढूंढें। कंपनी के लिए नई तकनीकों का मूल्यांकन करें और उन्हें उपयुक्त समझें। उन तकनीकों को वर्तमान में उपयोग में होने वाली तकनीकों से कुशल बनाएं और जरूरत अनुसार बदलाव करें।"
            }
        }
    },
    "irradia":{
        "short_description": "वेब डेवलपर",
        "roles":{
            "web_developer":{
                "name": "वेब डेवलपर",
                "description": "मैंने Wordpress के साथ बड़े पैमाने पर काम किया। मैंने Wordpress का उपयोग करके वेबसाइटों को बनाया और संशोधित किया, यह सुनिश्चित करते हुए कि साइटें कार्यात्मक, दृष्टिगत रूप से आकर्षक और विभिन्न उपकरणों और ब्राउज़रों के लिए अनुकूलित थीं। मैंने कस्टम प्लगइन्स भी विकसित किए हैं जो वेबसाइटों में विभिन्न सुविधाओं को जोड़ते हैं, जैसे सोशल मीडिया एकीकरण, संपर्क फ़ॉर्म और ई-कॉमर्स क्षमताएं। इसके अलावा, मैंने वर्डप्रेस वेबसाइटों के लिए कस्टम थीम बनाई, साइटों के लेआउट, रंग योजनाएं, फोंट और ग्राफिक्स डिजाइन किए। मैंने यह सुनिश्चित किया कि विषय उत्तरदायी हों, खोज इंजन अनुकूलन (एसईओ) के लिए अनुकूलित हों, और दिखने में आकर्षक हों। मैंने ग्राहकों को भी प्रबंधित किया और उन्हें सहायता प्रदान की। इसमें आवश्यकताओं को पूरा करने के लिए ग्राहकों के साथ संचार करना, परियोजनाओं की स्थिति पर अपडेट प्रदान करना और उन ग्राहकों को तकनीकी सहायता प्रदान करना शामिल था, जिनके पास अपनी वेबसाइटों के साथ प्रश्न या समस्याएँ थीं। कुल मिलाकर, इस अनुभव में वर्डप्रेस का उपयोग करके वेबसाइटों को बनाने, संशोधित करने और अनुकूलित करने के लिए वेब विकास सिद्धांतों और एचटीएमएल, सीएसएस, पीएचपी, और जावास्क्रिप्ट जैसी कोडिंग भाषाओं की मेरी मजबूत समझ का उपयोग करना शामिल है।"
            }
        }
    },
    "freelance_developer":{
        "short_description": "सॉफ्टवेयर और वेब डेवलपर",
        "roles":{
            "software_and_web_developer":{
                "name": "सॉफ्टवेयर और वेब डेवलपर",
                "description": "अपने फ्रीलांस अनुभव के दौरान, मुझे वर्डप्रेस का उपयोग करके वेबसाइट बनाने के लिए क्लाइंट्स के साथ काम करने का अवसर मिला। मैंने प्रत्येक ग्राहक के साथ मिलकर उनकी अनूठी जरूरतों और लक्ष्यों को समझने के लिए काम किया, और फिर उन आवश्यकताओं को पूरा करने के लिए कस्टम वर्डप्रेस वेबसाइटों को डिजाइन और विकसित किया। वेबसाइट विकास के अलावा, मैंने ग्राहकों को परामर्श सेवाएँ भी प्रदान कीं। इसमें ग्राहकों को वेबसाइट डिजाइन, अनुकूलन और रखरखाव के लिए सर्वोत्तम प्रथाओं पर सलाह देना शामिल है। मैंने ग्राहकों को उनकी वेबसाइटों के बारे में सूचित निर्णय लेने में मदद की और वेबसाइट के प्रदर्शन को बेहतर बनाने के लिए मार्गदर्शन प्रदान किया। मेरे वर्डप्रेस विकास कार्य में कस्टम थीम विकास, प्लगइन विकास, और एचटीएमएल/सीएसएस कोडिंग सहित विभिन्न प्रकार के कौशल का उपयोग शामिल है। मैंने यह सुनिश्चित किया कि मेरे द्वारा बनाई गई सभी वेबसाइटें उत्तरदायी हों और सर्वोत्तम संभव उपयोगकर्ता अनुभव सुनिश्चित करने के लिए खोज इंजनों के लिए अनुकूलित हों। पूरी प्रक्रिया के दौरान, मैंने ग्राहकों के साथ उनकी वेबसाइटों की प्रगति पर अद्यतन रखने और उनकी किसी भी चिंता को दूर करने के लिए स्पष्ट संचार बनाए रखा। मेरा लक्ष्य हमेशा ऐसी वेबसाइटों का निर्माण करना था जो न केवल ग्राहकों की ज़रूरतों को पूरा करती हों बल्कि उनकी अपेक्षाओं को पार भी करती हों। कुल मिलाकर, मेरे फ्रीलान्स अनुभव में वर्डप्रेस विकास और परामर्श में मेरी विशेषज्ञता का उपयोग करना शामिल है ताकि ग्राहकों को उच्च गुणवत्ता वाली वेबसाइटें प्रदान की जा सकें जो उनकी जरूरतों को पूरा करती हैं और उन्हें अपने लक्ष्यों को प्राप्त करने में मदद करती हैं।"
            }
        }
    },
    "travel_journal":{
        "short_description": "सोशल मीडिया एप्लिकेशन यात्रियों पर केंद्रित है",
        "roles":{
            "name": "सोशल मीडिया एप्लिकेशन यात्रियों पर केंद्रित है",
            "description": "एक सॉफ्टवेयर विकास परियोजना जिसमें एक सामाजिक मंच का निर्माण शामिल है। परियोजना को उपयोगकर्ता प्रबंधन, भूमिका प्रबंधन, मीडिया प्रबंधन, प्रोफ़ाइल प्रबंधन और फ़ीड प्रबंधन सहित कई स्वतंत्र प्रणालियों में विभाजित किया गया था। ये सिस्टम MySQL डेटाबेस तकनीक का उपयोग करके बनाए गए थे। प्रोजेक्ट के बैक-एंड के लिए, हमने Laravel का उपयोग एपीआई बनाने के लिए किया, जो विभिन्न प्रणालियों की कार्यक्षमता को उजागर करता है। इसने हमें सिस्टम के साथ आसानी से बातचीत करने और आवश्यक डेटा पुनर्प्राप्त करने की अनुमति दी। लारवेल बैक-एंड Vue.js फ्रंट-एंड एप्लिकेशन से अनुरोधों को संभालने और प्रासंगिक प्रतिक्रिया प्रदान करने के लिए जिम्मेदार था। प्रोजेक्ट का फ्रंट-एंड Vue.js का उपयोग करके बनाया गया था। Vue.js एप्लिकेशन लारवेल बैक-एंड के साथ इंटरफेस करने और डेटा को उपयोगकर्ता के अनुकूल तरीके से प्रस्तुत करने के लिए जिम्मेदार था। एप्लिकेशन ने उपयोगकर्ताओं को प्रोफाइल बनाने, उनकी फ़ीड प्रबंधित करने और सामाजिक मंच पर अन्य उपयोगकर्ताओं के साथ बातचीत करने की अनुमति दी। कुल मिलाकर, परियोजना को डेटाबेस प्रौद्योगिकी, एपीआई विकास और फ्रंट-एंड विकास की एक मजबूत समझ की आवश्यकता थी। मैंने इन तकनीकों के अपने ज्ञान का उपयोग एक मजबूत और कुशल सामाजिक मंच बनाने के लिए किया जो उपयोगकर्ताओं की जरूरतों को पूरा करता हो।"
        }
    },
    "coinsxplorers":{
        "short_description": "डेटा एकत्रीकरण के साथ क्रिप्टो ट्रैकिंग ऐप",
        "roles":{
            "name": "डेटा एकत्रीकरण के साथ क्रिप्टो ट्रैकिंग ऐप",
            "description": "एक सॉफ्टवेयर डेवलपमेंट प्रोजेक्ट, मैं क्रिप्टोकरेंसी को ट्रैक करने के लिए एक प्लेटफॉर्म बनाने में शामिल था। परियोजना में दो मुख्य घटक शामिल थे: एक लारवेल बैक-एंड और एक रिएक्ट फ्रंट-एंड। Laravel बैक-एंड ने वास्तविक समय में क्रिप्टोक्यूरेंसी की कीमतों को पुनः प्राप्त करने के लिए Coingecko API के साथ इंटरफेस किया। हमने यह सुनिश्चित करने के लिए डेटा पर एकत्रीकरण तर्क लागू किया कि यह सटीक और विश्वसनीय था। लारवेल बैक-एंड डेटा को प्रोसेस करने और एपीआई के माध्यम से रिएक्ट फ्रंट-एंड को उपलब्ध कराने के लिए जिम्मेदार था। रिएक्ट फ्रंट-एंड को क्रिप्टोक्यूरेंसी डेटा को स्पष्ट और उपयोगकर्ता के अनुकूल तरीके से प्रस्तुत करने के लिए डिज़ाइन किया गया था। हमने उपयोगकर्ताओं को डेटा को बेहतर ढंग से समझने में मदद करने के लिए विभिन्न डेटा विज़ुअलाइज़ेशन तकनीकों का उपयोग किया। फ्रंट-एंड ने उपयोगकर्ताओं को क्रिप्टोक्यूरेंसी कीमतों का विश्लेषण और तुलना करने के लिए उपकरण भी प्रदान किए। परियोजना को एपीआई विकास, डेटा एकत्रीकरण और फ्रंट-एंड विकास की एक मजबूत समझ की आवश्यकता थी। मैंने इन तकनीकों के अपने ज्ञान का उपयोग एक मजबूत और कुशल मंच बनाने के लिए किया जो हमारे उपयोगकर्ताओं की जरूरतों को पूरा करता है।"
        }
    }
}